package Util;

import org.junit.Test;

import static org.junit.Assert.*;

/**
 * Created by yamengwenjing on 2017-04-15.
 */
public class DocumentAuxTest {


    @Test
    public void getSummaryFromWSsummary() throws Exception {
//        DocumentAux.getSummaryFromWSsummary("\"原标题：首届世界媒体峰会全球新闻奖评选启动\\n\\n据新华社电（记者黄富慧）记者6月15日从世界媒体峰会秘书处获悉，首届世界媒体峰会全球新闻奖评选工作即日起正式启动，并面向全球征稿。该奖拟设立公益奖、创新奖和报道奖三大类奖项。\\n\\n\\n世界媒体峰会全球新闻奖是2013年10月在中国杭州举行的世界媒体峰会第二次主席团会议决定设立的。全球新闻奖的宗旨为“真实、客观、卓越”。这是峰会创建的首个涵盖多种媒体业态、覆盖全球的综合性新闻赛事。\\n\\n\\n全球新闻奖面向全球媒体机构和媒体从业人员，参赛作品须为全球各媒体机构业已发表、刊播的新闻作品或正式运行的媒体项目，发表或运行时间为2012年1月1日至2013年12月31日。征稿时间为2014年7月1日至9月30日。评选结果预计于2014年11月公布。\\n\\n\\n世界媒体峰会是由世界知名媒体机构倡议发起的高端交流平台，首届峰会于2009年10月在中国北京举行，第二届峰会于2012年7月在莫斯科举行。由主席团成员机构代表组成的世界媒体峰会秘书处设在新华社。\\n\"");

    }

}